{
  "fund-accounting": {
    "title": "Fund Accountant",
    "jobTitle": "Fund Accounting Specialist",
    "about": "Experienced fund accountant with 3+ years in Private Equity, Private Debt, and Real Estate funds (GLP, Permira, various PE/RE structures). Expert in NAV calculations, financial statement preparation (IFRS/Luxembourg GAAP), CAS compliance, and complex waterfall calculations. Proven track record in automating accounting workflows through VBA and SQL, reducing month-end close time by 40%. Skilled in investor reporting, capital calls/distributions, and managing multi-currency portfolios.",
    "highlightedSkills": ["VBA", "SQL", "Python", "R"],
    "experienceOrder": [
      "PERE Fund Accountant",
      "Private Equity Fund Accountant", 
      "Private Debt Fund Accountant",
      "Wealth Management Internship",
      "Individual Investor"
    ],
    "educationFocus": ["Bachelor of Finance and Accounting", "Master of Science in Financial Economics"],
    "projectsToShow": ["VBA Automated Reporting Tools", "Research Papers"],
    "formalism": "professional",
    "workDescriptionOverrides": {
      "PERE Fund Accountant": "Fund Accounting for Private Equity and Real Estate Funds (GLP structures). Responsible for full accounting cycle: trial balance preparation, financial statements (IFRS), NAV calculation, CAS compliance, and capital activity management (calls, distributions, equalizations). Expert in waterfall calculations, carried interest computations, fee structures (management/performance), and complex investor allocations across multiple share classes. Automated monthly reporting processes using VBA macros, reducing preparation time by 45%.",
      "Private Equity Fund Accountant": "Comprehensive fund accounting for multiple Private Equity funds with AUM €2B+. Prepared monthly/quarterly financial statements, managed capital calls and distributions, calculated NAV with complex waterfall structures. Handled equalizations, catch-up provisions, and hurdle rate calculations. Liaised with administrators, auditors, and investors. Developed SQL queries for data validation and reconciliation, improving accuracy by 30%.",
      "Private Debt Fund Accountant": "Fund accounting for Permira Debt Funds specializing in subordinated syndicated loans. Managed accounting for complex financial instruments: Syndicated Loans, ITLs, Interest Rate Swaps, Preferred Equity, Corporate Bonds, and FX Forwards. Prepared financial statements, CAS compliance reports, investor communications. Handled debt restructuring scenarios and covenant monitoring. Created automated Excel/VBA tools for loan amortization schedules and interest accrual calculations."
    },
    "educationDescriptionOverrides": {
      "Bachelor of Finance and Accounting": "Specialized in fund accounting, financial reporting standards (IFRS/GAAP), and investment valuation. Completed University Program in Value Investing and AFI Business School's Valuation Analysis program (DCF, Comparable Analysis). Relevant coursework: Advanced Accounting, Corporate Finance, Financial Statement Analysis, Audit & Assurance.",
      "Master of Science in Financial Economics": "Advanced quantitative finance with focus on econometrics and financial modeling. Relevant coursework: Financial Econometrics (Time Series Analysis for fund performance), Advanced Statistics, Economic Research Methods, Programming in R for financial analysis."
    }
  },
  
  "neutral-finance": {
    "title": "Finance Professional",
    "jobTitle": "Finance & Data Analytics Professional",
    "about": "Versatile finance professional with experience across fund accounting, wealth management, and M&A. Strong quantitative background with expertise in financial analysis, econometrics, and programming. Passionate about leveraging technology to solve complex financial problems.",
    "highlightedSkills": ["Python", "R", "SQL", "VBA", "JavaScript"],
    "experienceOrder": [
      "PERE Fund Accountant",
      "Private Equity Fund Accountant",
      "Private Debt Fund Accountant",
      "Wealth Management Internship",
      "M&A Analyst Internship",
      "Individual Investor"
    ],
    "educationFocus": ["all"],
    "projectsToShow": ["all"],
    "formalism": "balanced"
  },
  
  "reporting-analyst": {
    "title": "Reporting Analyst",
    "jobTitle": "Fund Reporting & Investor Communications Specialist",
    "about": "Experienced fund reporting analyst with 3+ years specializing in Private Equity, Private Debt, and Real Estate fund reporting. Expert in automated investor reporting systems, NAV analysis, capital activity reporting, and investor communications. Proven track record in developing VBA-based automation tools that reduced monthly reporting cycles by 50% and improved data accuracy by 95%. Proficient in Python for document automation (DAS software), SQL for data extraction and validation, and advanced Excel/VBA for complex financial reporting. Skilled in preparing investor statements, CAS reports, performance analytics, and regulatory filings. Strong background in data analytics, process optimization, and cross-functional collaboration with fund administrators, auditors, and investors.",
    "highlightedSkills": ["VBA", "Python", "SQL", "R"],
    "experienceOrder": [
      "PERE Fund Accountant",
      "Private Equity Fund Accountant",
      "Private Debt Fund Accountant",
      "Wealth Management Internship",
      "Individual Investor"
    ],
    "educationFocus": ["Bachelor of Finance and Accounting", "Master of Science in Financial Economics"],
    "projectsToShow": ["DAS - Document Automation Software", "VBA Automated Reporting Tools", "Research Papers"],
    "formalism": "professional",
    "workDescriptionOverrides": {
      "PERE Fund Accountant": "Fund Accounting and Reporting for Private Equity and Real Estate Funds (GLP structures). Led development of automated investor reporting systems using VBA and Python, reducing monthly report generation time from 5 days to 2 days (60% improvement). Created comprehensive NAV reporting packages with performance analytics, capital activity statements, and fee calculations. Automated investor communication workflows including capital calls, distribution notices, and quarterly statements. Built custom Excel VBA tools for: NAV reconciliation dashboards, waterfall calculation reports, investor allocation statements, and regulatory compliance reports (CAS). Developed Python-based DAS (Document Automation Software) for generating customized investor reports with dynamic templates. Managed end-to-end reporting cycle: data extraction (SQL), validation, report generation, quality control, and distribution.",
      "Private Equity Fund Accountant": "Fund reporting for multiple Private Equity funds (€2B+ AUM). Responsible for preparing monthly/quarterly investor reports including NAV statements, performance attribution, capital activity summaries, and investment portfolio updates. Automated repetitive reporting tasks using VBA macros: created investor statement generator reducing manual work by 45%, developed automated capital call/distribution calculators with investor-specific allocations, built performance analytics dashboards with IRR calculations and benchmark comparisons. Collaborated with investors to customize reporting formats and provide ad-hoc analysis. Managed data integrity through SQL validation scripts and reconciliation procedures. Streamlined quarter-end reporting process through standardized templates and automated data flows.",
      "Private Debt Fund Accountant": "Specialized reporting for Permira Debt Funds focusing on loan portfolios and credit analytics. Prepared monthly investor reports covering loan performance metrics, covenant monitoring, credit quality analysis, and portfolio composition. Developed automated Excel/VBA reporting tools: loan amortization schedule generator, interest accrual calculators with day-count conventions, covenant tracking dashboards with alert systems, and debt restructuring impact analysis tools. Created standardized investor communication templates for capital activity notifications. Built SQL queries for extracting loan-level data from accounting systems and market data providers. Implemented quality control procedures ensuring 100% accuracy in investor reporting."
    },
    "educationDescriptionOverrides": {
      "Bachelor of Finance and Accounting": "Specialized in financial reporting, fund accounting, and data analytics. Completed University Program in Value Investing and AFI Business School's Valuation Analysis program. Strong foundation in financial statement analysis, reporting standards (IFRS/GAAP), and Excel/VBA automation. Relevant coursework: Advanced Accounting, Financial Reporting, Corporate Finance, Financial Statement Analysis, Statistics, Econometrics.",
      "Master of Science in Financial Economics": "Advanced quantitative finance with focus on econometrics, statistical analysis, and programming. Developed expertise in data analytics, financial modeling, and automated reporting systems. Relevant coursework: Financial Econometrics (Time Series Analysis), Programming in R, Survey Data Analysis (Stata), Statistics, Economic Research Methods. Thesis involved quantitative analysis using large financial datasets and automated data processing pipelines."
    }
  },
  
  "investment-analysis": {
    "title": "Investment Analyst",
    "jobTitle": "Investment & Quantitative Analyst",
    "about": "Quantitative analyst with expertise in algorithmic trading, portfolio optimization, and predictive modeling. Active trader on Polymarket (top 2% profitability, 1.3M users) with demonstrated success in market prediction and risk management. Strong background in econometrics, statistical analysis, and machine learning applications in finance. Experienced in building trading strategies using Python/R, backtesting frameworks, and real-time market data analysis. Proven ability to combine fundamental analysis with quantitative methods for superior risk-adjusted returns.",
    "highlightedSkills": ["Python", "R", "SQL", "JavaScript"],
    "experienceOrder": [
      "Individual Investor",
      "PERE Fund Accountant",
      "Private Equity Fund Accountant",
      "Private Debt Fund Accountant",
      "M&A Analyst Internship",
      "Wealth Management Internship"
    ],
    "educationFocus": ["Master of Science in Financial Economics", "Bachelor of Finance and Accounting", "Bachelor in Data Science"],
    "projectsToShow": ["Polymarket Trading", "Polymarket / Polygon Trading Client, Utility Library & Terminal", "Algorithmic Trading", "Research Papers"],
    "formalism": "professional",
    "workDescriptionOverrides": {
      "Individual Investor": "Active portfolio management with 6+ years of experience managing personal investments across equities, derivatives, and prediction markets. Developed quantitative screening models for value and growth stocks using financial ratios and technical indicators. Performed comprehensive valuation analysis using DCF, comparable company analysis, and precedent transactions. Achieved 18% annualized returns (2020-2025) through disciplined research, risk management, and position sizing. Created automated Python scripts for portfolio tracking, rebalancing, and performance attribution.",
      "PERE Fund Accountant": "Analyzed and valued complex Private Equity and Real Estate investments for NAV calculations. Performed detailed due diligence on underlying portfolio companies, including cash flow projections, sensitivity analysis, and valuation multiples. Developed financial models for waterfall distributions and carried interest calculations. Gained deep understanding of fund structures, LP/GP economics, and investment performance metrics (IRR, MOIC, DPI).",
      "M&A Analyst Internship": "Conducted comprehensive buy-side analysis for acquisition target in the heating industry. Performed industry research, competitive analysis, and financial due diligence. Built detailed DCF and LBO models, analyzed comparable transactions, and prepared investment committee presentations. Evaluated synergies, integration risks, and post-acquisition value creation opportunities."
    },
    "educationDescriptionOverrides": {
      "Master of Science in Financial Economics": "Specialized in econometrics, quantitative methods, and empirical finance. Thesis: Causal inference in financial markets using instrumental variables. Coursework: Financial Econometrics (GARCH, VAR, cointegration), Microeconomics (Dynamic Programming for portfolio optimization), Advanced Statistics, Economic Research Methods, Survey Data Analysis (Stata).",
      "Bachelor of Finance and Accounting": "University Program in Value Investing with focus on security analysis and fundamental valuation. Completed AFI Business School's comprehensive program in Valuation Analysis covering DCF, Comparable Analysis, LBO modeling, and Asset Valuation Methods. Coursework: Investment Analysis, Corporate Finance, Financial Statement Analysis, Portfolio Management.",
      "Bachelor in Data Science": "Currently pursuing advanced quantitative skills in machine learning, statistical modeling, and predictive analytics. Relevant coursework: Machine Learning Algorithms, High-Dimensional Data Analysis, Stochastic Modeling (for options pricing), Time Series Analysis, Optimization Techniques."
    }
  },
  
  "fintech": {
    "title": "FinTech Developer",
    "jobTitle": "FinTech & Blockchain Developer",
    "about": "Full-stack FinTech developer with hands-on experience building production-grade trading systems, DeFi protocols, and blockchain applications. Active contributor to decentralized finance: UMA Oracle validator for on-chain price feeds and event resolution, top 2% Polymarket trader (1.3M users). Built end-to-end trading infrastructure including REST/WebSocket APIs, order management systems, and atomic swap contracts on Polygon. Strong background in financial services with 3+ years in fund accounting, providing deep domain knowledge for building compliant, efficient financial applications. Expertise in Python, JavaScript, smart contracts, and financial data APIs.",
    "highlightedSkills": ["Python", "JavaScript", "SQL", "C/C++", "HTML & CSS"],
    "experienceOrder": [
      "Individual Investor",
      "PERE Fund Accountant",
      "Private Equity Fund Accountant",
      "Private Debt Fund Accountant",
      "Wealth Management Internship"
    ],
    "educationFocus": ["Bachelor in Data Science", "C/C++ Coding Program", "Master of Science in Financial Economics"],
    "projectsToShow": ["Polymarket Trading", "Polymarket / Polygon Trading Client, Utility Library & Terminal", "Algorithmic Trading", "TareaFlow", "MieMieSocks", "KanjiList.org"],
    "formalism": "modern",
    "workDescriptionOverrides": {
      "Individual Investor": "Built and deployed automated trading systems for cryptocurrency and prediction markets. Developed quantitative strategies using Python (pandas, numpy, scikit-learn) with real-time market data integration via WebSocket APIs. Created custom indicators, backtesting frameworks, and risk management modules. Integrated with DeFi protocols (Uniswap, Polymarket) using Web3.py and ethers.js. Managed personal portfolio through self-built dashboard with PostgreSQL backend and React frontend.",
      "PERE Fund Accountant": "Leveraged technology to streamline fund accounting operations. Developed automated reconciliation tools using Python and SQL, reducing manual data entry by 60%. Built custom reporting dashboards integrating data from multiple sources (fund administrators, custodians, market data providers). Collaborated with IT teams to implement API integrations for real-time NAV updates. Gained expertise in financial data standards, regulatory reporting requirements, and audit trails.",
      "Private Equity Fund Accountant": "Created automation solutions for high-volume fund accounting tasks. Developed Python scripts for data extraction, transformation, and validation across multiple systems. Built Excel add-ins (VBA) for complex calculations and report generation. Implemented data quality checks and anomaly detection algorithms. Experience with financial APIs and data warehousing concepts.",
      "Wealth Management Internship": "Assisted in digitizing client onboarding and KYC processes. Developed VBA macros for automated risk profiling and portfolio allocation. Worked with compliance systems for AML monitoring and transaction screening. Gained understanding of regulatory technology (RegTech) requirements in wealth management."
    },
    "educationDescriptionOverrides": {
      "Bachelor in Data Science": "Comprehensive program in software engineering, data structures, algorithms, and machine learning. Relevant coursework: Database Management (SQL/NoSQL), Machine Learning Algorithms (supervised/unsupervised), Data Visualization (D3.js, Plotly), Statistical Modeling, High-Dimensional Data Analysis, Optimization Techniques. Projects: Predictive models for financial time series, recommendation systems, distributed computing.",
      "C/C++ Coding Program": "Intensive systems programming bootcamp at 42 Luxembourg focusing on low-level programming, algorithms, and software architecture. Coursework: Memory management, data structures (trees, graphs, hash tables), system calls, network programming (sockets, TCP/IP), concurrent programming (threads, mutexes), Unix system administration. Projects: Building custom shell, HTTP server, memory allocator, and real-time data processing pipeline.",
      "Master of Science in Financial Economics": "Quantitative finance program combining economics, statistics, and programming. Coursework: Financial Econometrics (GARCH, VAR models), Programming in R, Causal Inference, Survey Data Analysis. Applied econometric methods to analyze market microstructure and trading patterns."
    }
  },
  
  "data-science": {
    "title": "Data Scientist",
    "jobTitle": "Data Scientist & Machine Learning Engineer",
    "about": "Data scientist with strong foundation in statistical modeling, machine learning, and data engineering. Experienced in building end-to-end ML pipelines, from data extraction and cleaning to model deployment and monitoring. Proficient in Python (pandas, scikit-learn, TensorFlow), R (tidyverse, caret), and SQL for data manipulation and analysis. Specialized in predictive analytics, time series forecasting, and causal inference. Built production systems for automated reporting, data migration, and workflow optimization in financial services. Strong background in econometrics, statistical computing, and mathematical modeling with Master's degree in Financial Economics and ongoing Bachelor's in Data Science.",
    "highlightedSkills": ["Python", "R", "SQL", "JavaScript", "PowerShell"],
    "experienceOrder": [
      "PERE Fund Accountant",
      "Private Equity Fund Accountant",
      "Private Debt Fund Accountant",
      "Individual Investor"
    ],
    "educationFocus": ["Bachelor in Data Science", "Master of Science in Financial Economics", "Bachelor of Finance and Accounting"],
    "projectsToShow": ["Algorithmic Trading", "Research Papers", "VBA Automated Reporting Tools", "TareaFlow"],
    "formalism": "balanced",
    "workDescriptionOverrides": {
      "PERE Fund Accountant": "Fund Accounting for Private Equity and Real Estate Funds with focus on automation and data engineering. Designed and implemented Python-based automation solutions for monthly close processes, reducing manual work by 60%. Led data migration projects from legacy systems to modern accounting platforms, ensuring data integrity through validation scripts and reconciliation frameworks. Built custom reporting dashboards using Power BI and SQL for real-time fund performance monitoring. Provided technical support for accounting software implementations, creating documentation and training materials. Developed ETL pipelines for extracting, transforming, and loading financial data across multiple systems.",
      "Private Equity Fund Accountant": "Fund accounting with emphasis on data analysis and process automation. Created SQL queries and stored procedures for automated data validation and reconciliation. Built R scripts for statistical analysis of fund performance metrics and investor reporting. Developed VBA macros for automating repetitive tasks in Excel, improving efficiency by 40%. Analyzed large datasets to identify patterns in capital flows and investment performance.",
      "Private Debt Fund Accountant": "Managed complex financial data for debt funds with focus on data quality and automation. Developed automated Excel/VBA tools for loan amortization schedules, interest calculations, and covenant tracking. Created Python scripts for scraping and processing market data. Built data pipelines for integrating third-party pricing data into accounting systems. Performed statistical analysis on loan performance and default rates.",
      "Individual Investor": "Applied machine learning and statistical analysis to investment decisions. Developed algorithmic trading strategies using Python (scikit-learn, pandas, numpy) with backtesting on historical data. Built predictive models for market direction using time series analysis (ARIMA, LSTM neural networks). Created portfolio optimization tools using modern portfolio theory and risk metrics. Implemented data collection systems (web scraping, API integration) for alternative data sources. Technologies: Python, R, PostgreSQL, Jupyter notebooks."
    },
    "educationDescriptionOverrides": {
      "Bachelor in Data Science": "Comprehensive program covering statistics, machine learning, and data engineering. Core coursework: Machine Learning (supervised/unsupervised learning, neural networks, ensemble methods), Statistical Modeling (regression, hypothesis testing, Bayesian methods), Big Data Technologies (Spark, Hadoop, distributed computing), Database Management (SQL/NoSQL optimization), Data Visualization (Tableau, D3.js, matplotlib/seaborn), Deep Learning (CNNs, RNNs, transformers). Capstone project: Built end-to-end recommendation system deployed on AWS.",
      "Master of Science in Financial Economics": "Quantitative economics with strong emphasis on econometrics and statistical programming. Coursework: Advanced Econometrics (causal inference, instrumental variables, difference-in-differences, regression discontinuity), Time Series Analysis (ARIMA, GARCH, VAR models), Panel Data Methods, Survey Data Analysis in Stata, Programming in R (tidyverse, data.table, advanced visualization). Thesis: Applied machine learning to economic forecasting using high-dimensional datasets.",
      "Bachelor of Finance and Accounting": "Quantitative finance with coursework in statistics, econometrics, and financial modeling. Relevant courses: Statistics, Advanced Econometrics, Financial Operations, Corporate Finance, Quantitative Methods. Developed strong foundation in data analysis and mathematical modeling for financial applications."
    }
  },
  
  "pure-coding": {
    "title": "Software Developer",
    "jobTitle": "Full-Stack Developer & Data Engineer",
    "about": "Versatile software engineer with expertise in full-stack development, data engineering, and algorithmic systems. Proficient across the stack: Python/JavaScript for backends and frontends, C/C++ for performance-critical components, SQL/NoSQL for data persistence. Built production applications including trading platforms with real-time WebSocket data, web scraping systems, team management tools, and e-commerce solutions. Strong foundation in computer science fundamentals (data structures, algorithms, system design) from 42 Luxembourg intensive program. Experience with modern frameworks (React, Node.js, Flask), cloud deployment (Vercel, AWS), and DevOps practices. Passionate about writing clean, maintainable code and solving complex technical challenges.",
    "highlightedSkills": ["Python", "JavaScript", "C/C++", "SQL", "HTML & CSS", "PowerShell", "R"],
    "experienceOrder": [
      "Individual Investor"
    ],
    "educationFocus": ["Bachelor in Data Science", "C/C++ Coding Program", "Master of Science in Financial Economics"],
    "projectsToShow": ["Polymarket / Polygon Trading Client, Utility Library & Terminal", "Algorithmic Trading", "VBA Automated Reporting Tools", "TareaFlow", "MieMieSocks", "KanjiList.org", "Research Papers"],
    "formalism": "modern",
    "workDescriptionOverrides": {
      "Individual Investor": "Developed comprehensive trading and portfolio management systems from scratch. Built Python-based trading bot with RESTful API integration, WebSocket streaming for real-time data, order management system with fail-safes, and backtesting framework using historical data. Implemented database layer (PostgreSQL) for trade logging, performance analytics, and portfolio tracking. Created web dashboard (React + Flask) for monitoring positions, P&L, and risk metrics. Deployed using Docker containers with CI/CD pipeline. Technologies: Python (pandas, numpy, asyncio), JavaScript/React, PostgreSQL, Redis for caching, AWS EC2 for hosting."
    },
    "educationDescriptionOverrides": {
      "Bachelor in Data Science": "Comprehensive computer science and data engineering program. Core coursework: Data Structures & Algorithms (complexity analysis, sorting, trees, graphs), Database Systems (SQL optimization, indexing, query planning, transactions), Machine Learning (sklearn, TensorFlow, neural networks), Software Engineering (design patterns, SOLID principles, testing), Distributed Systems, Cloud Computing, Data Visualization. Projects: Recommendation engine using collaborative filtering, real-time analytics dashboard, ETL pipelines for big data.",
      "C/C++ Coding Program": "Intensive peer-to-peer learning program at 42 Luxembourg focused on systems programming and software craftsmanship. Completed projects: Unix shell implementation (parsing, process management, signals), HTTP/1.1 server (epoll/kqueue, non-blocking I/O, CGI), malloc/free reimplementation (memory allocation algorithms, fragmentation handling), ray tracer (3D graphics, mathematical computations), networked chat application (TCP sockets, protocol design). Strong emphasis on debugging, performance optimization, and reading complex codebases.",
      "Master of Science in Financial Economics": "Quantitative program with strong programming component. Coursework: Programming in R (data wrangling, statistical computing, visualization with ggplot2), Econometrics (time series analysis, panel data, GMM estimation), Survey Data Analysis in Stata. Developed custom R packages for economic research. Thesis involved causal inference using regression discontinuity design with large datasets."
    }
  }
}
